var canvasModels = {
    classic: [
        [
            ['Партнеры'],
            ['Деятельность', 'Ресурсы'],
            ['Ценностное предложение'],
            ['Отношения с клиентами', 'Каналы распространения'],
            ['Сегменты потребителей']
        ],
        [
            ['Расходы'],
            ['Доходы']
        ]
    ],
    lean: [
        [
            ['Проблема'],
            ['Решение', 'Ключевые метрики'],
            ['Уникальное предложение'],
            ['Неконкурентное преимущество', 'Каналы распространения'],
            ['Сегменты потребителей']
        ],
        [
            ['Расходы'],
            ['Доходы']
        ]
    ],
    iidf: [
        [
            ['Проблема'],
            ['Технология', 'Продукт'],
            ['Рынок'],
            ['Каналы распространения', 'Воронка продаж'],
            ['Клиент']
        ],
        [
            ['Экономика продукта']
        ]
    ]
};

var canvas = riot.mount('canvas-model')[0];
var model = canvas.children[0];
debugger;
model.update({
    opts: {
        rows: canvasModels.classic
    }
});
